In [1]:
import pandas as pd
import numpy as np
t=pd.DataFrame(np.arange(12).reshape(3,4))

In [2]:
t

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [4]:
t=pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("xyzq"))  %记住是list格式

In [5]:
t

   x  y   z   q
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [8]:
d1={"name":["xiaoming","xiaohong","xiaogang"],"age":[30,32,50],"tel":[10086,10054,10087]}

In [9]:
d1

{'age': [30, 32, 50],
 'name': ['xiaoming', 'xiaohong', 'xiaogang'],
 'tel': [10086, 10054, 10087]}

In [10]:
pd.DataFrame(d1)

   age      name    tel
0   30  xiaoming  10086
1   32  xiaohong  10054
2   50  xiaogang  10087